app/controllers/api/animes_controller.rb

SELECT "animes".* FROM "animes"
---
    def index
        @animes = Anime.all

SELECT  "animes".* FROM "animes" WHERE "animes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @anime = Anime.find(params[:id])