app/controllers/api/shows_controller.rb

    def show
        @show = Show.find(params[:id])
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]